# DefaultConstructionMassRoof Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DefaultConstructionMassRoof Property
ParameterTypeId Class See Also
---
"Mass Roof"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DefaultConstructionMassRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefaultConstructionMassRoof As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DefaultConstructionMassRoof {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace